<?php

return [
    'form' => [
        'sections' => [
            'general' => [
                'title' => 'عام',

                'fields' => [
                    'company'    => 'الشركة',
                    'avatar'     => 'الصورة الشخصية',
                    'tax-id'     => 'الرقم الضريبي',
                    'job-title'  => 'المسمى الوظيفي',
                    'phone'      => 'الهاتف',
                    'mobile'     => 'الجوال',
                    'email'      => 'البريد الإلكتروني',
                    'website'    => 'الموقع الإلكتروني',
                    'title'      => 'المسمى',
                    'name'       => 'الاسم',
                    'short-name' => 'الاسم المختصر',
                    'tags'       => 'العلامات',
                    'color'      => 'اللون',
                ],

                'address' => [
                    'title' => 'العنوان',

                    'fields' => [
                        'street1'  => 'الشارع 1',
                        'street2'  => 'الشارع 2',
                        'city'     => 'المدينة',
                        'zip'      => 'الرمز البريدي',
                        'state'    => 'المنطقة',
                        'country'  => 'الدولة',
                        'name'     => 'الاسم',
                        'code'     => 'الرمز',
                    ],
                ],
            ],
        ],
    ],

    'infolist' => [
        'sections' => [
            'general' => [
                'title' => 'عام',

                'fields' => [
                    'company'    => 'الشركة',
                    'avatar'     => 'الصورة الشخصية',
                    'tax-id'     => 'الرقم الضريبي',
                    'job-title'  => 'المسمى الوظيفي',
                    'phone'      => 'الهاتف',
                    'mobile'     => 'الجوال',
                    'email'      => 'البريد الإلكتروني',
                    'website'    => 'الموقع الإلكتروني',
                    'title'      => 'المسمى',
                    'name'       => 'الاسم',
                    'short-name' => 'الاسم المختصر',
                    'tags'       => 'العلامات',
                ],

                'address' => [
                    'title' => 'العنوان',

                    'fields' => [
                        'street1'  => 'الشارع 1',
                        'street2'  => 'الشارع 2',
                        'city'     => 'المدينة',
                        'zip'      => 'الرمز البريدي',
                        'state'    => 'المنطقة',
                        'country'  => 'الدولة',
                        'name'     => 'الاسم',
                        'code'     => 'الرمز',
                    ],
                ],
            ],
        ],

        'tabs' => [
            'sales-purchase' => [
                'title' => 'المبيعات والمشتريات',

                'fields' => [
                    'responsible'           => 'المسؤول',
                    'responsible-hint-text' => 'هذا هو مندوب المبيعات الداخلي المسؤول عن هذا العميل',
                    'company-id'            => 'رقم الشركة',
                    'company-id-hint-text'  => 'رقم تسجيل الشركة. استخدمه إذا كان مختلفًا عن الرقم الضريبي. يجب أن يكون فريدًا بين جميع الشركاء في نفس البلد',
                    'reference'             => 'المرجع',
                    'industry'              => 'الصناعة',
                ],
            ],
        ],
    ],
]; 