<?php

return [
    'tabs' => [
        'all'      => 'جميع المستخدمين',
        'archived' => 'المستخدمون المؤرشفون',
    ],

    'header-actions' => [
        'invite' => [
            'title' => 'دعوة مستخدم',
            'modal' => [
                'submit-action-label' => 'دعوة مستخدم',
            ],
            'form' => [
                'email' => 'البريد الإلكتروني',
            ],
            'notification' => [
                'success' => [
                    'title' => 'تمت دعوة المستخدم',
                    'body'  => 'تمت دعوة المستخدم بنجاح',
                ],
                'error' => [
                    'title' => 'فشل في دعوة المستخدم',
                    'body'  => 'واجه النظام خطأ غير متوقع أثناء محاولة إرسال دعوة المستخدم.',
                ],

                'default-company-error' => [
                    'title' => 'لم يتم تعيين الشركة الافتراضية',
                    'body'  => 'يرجى تعيين الشركة الافتراضية من الإعدادات قبل دعوة مستخدم.',
                ],
            ],
        ],

        'create' => [
            'label' => 'مستخدم جديد',
        ],
    ],
];
