<?php

return [
    'label'        => 'توليد الأنواع',
    'notification' => [
        'empty' => [
            'title' => 'لم يتم العثور على خصائص',
            'body'  => 'يرجى إضافة خصائص لتوليد الأنواع.',
        ],
        'success' => [
            'title' => 'تم توليد الأنواع بنجاح',
            'body'  => 'تم توليد جميع أنواع المنتج.',
        ],
        'error' => [
            'title' => 'خطأ في توليد الأنواع',
            'body'  => 'حدث خطأ أثناء توليد أنواع المنتج.',
        ],
    ],
]; 