<?php

return [
    'navigation' => [
        'title' => 'الإيصالات',
        'group' => 'التحويلات',
    ],

    'table' => [
        'actions' => [
            'delete' => [
                'notification' => [
                    'success' => [
                        'title' => 'تم حذف الإيصال',
                        'body'  => 'تم حذف الإيصال بنجاح.',
                    ],

                    'error' => [
                        'title' => 'تعذر حذف الإيصال',
                        'body'  => 'لا يمكن حذف الإيصال لأنه قيد الاستخدام حاليًا.',
                    ],
                ],
            ],
        ],

        'bulk-actions' => [
            'delete' => [
                'notification' => [
                    'success' => [
                        'title' => 'تم حذف الإيصالات',
                        'body'  => 'تم حذف الإيصالات بنجاح.',
                    ],

                    'error' => [
                        'title' => 'تعذر حذف الإيصالات',
                        'body'  => 'لا يمكن حذف الإيصالات لأنها قيد الاستخدام حاليًا.',
                    ],
                ],
            ],
        ],
    ],
];
