<?php

return [
    'navigation' => [
        'title' => 'المنتجات',
        'group' => 'المخزون',
    ],

    'form' => [
        'sections' => [
            'inventory' => [
                'title' => 'المخزون',

                'fieldsets' => [
                    'tracking' => [
                        'title' => 'التتبع',

                        'fields' => [
                            'track-inventory'              => 'تتبع المخزون',
                            'track-inventory-hint-tooltip' => 'المنتج القابل للتخزين هو المنتج الذي يتطلب إدارة للمخزون.',
                            'track-by'                     => 'التتبع بواسطة',
                            'expiration-date'              => 'تاريخ انتهاء الصلاحية',
                            'expiration-date-hint-tooltip' => 'إذا تم التحديد، يمكنك تحديد تواريخ انتهاء الصلاحية للمنتج وأرقام الدفعات/التسلسلية المرتبطة به.',
                        ],
                    ],

                    'operation' => [
                        'title' => 'العمليات',

                        'fields' => [
                            'routes'              => 'الطرق',
                            'routes-hint-tooltip' => 'اعتمادًا على الوحدات المثبتة، تتيح لك هذه الإعدادات تحديد مسار المنتج مثل الشراء أو التصنيع أو التجديد عند الطلب.',
                        ],
                    ],

                    'logistics' => [
                        'title' => 'اللوجستيات',

                        'fields' => [
                            'responsible'              => 'المسؤول',
                            'responsible-hint-tooltip' => 'مدة التسليم (بأيام) تمثل المدة الموعودة بين تأكيد طلب البيع وتسليم المنتج.',
                            'weight'                   => 'الوزن',
                            'volume'                   => 'الحجم',
                            'sale-delay'               => 'مدة انتظار العميل (أيام)',
                            'sale-delay-hint-tooltip'  => 'مدة التسليم (بأيام) تمثل المدة الموعودة بين تأكيد طلب البيع وتسليم المنتج.',
                        ],
                    ],

                    'traceability' => [
                        'title' => 'القابلية للتتبع',

                        'fields' => [
                            'expiration-date'               => 'تاريخ انتهاء الصلاحية (بأيام)',
                            'expiration-date-hint-tooltip'  => 'إذا تم التحديد، يمكنك تعيين تواريخ انتهاء الصلاحية للمنتج وأرقام الدفعات/التسلسلية المرتبطة به.',
                            'best-before-date'              => 'أفضل استخدام قبل (بأيام)',
                            'best-before-date-hint-tooltip' => 'عدد الأيام قبل تاريخ الانتهاء حيث يبدأ المنتج في التلف، ولكنه لا يزال آمنًا للاستخدام. يتم حسابه بناءً على رقم الدفعة/التسلسل.',
                            'removal-date'                  => 'تاريخ الإزالة (بأيام)',
                            'removal-date-hint-tooltip'     => 'عدد الأيام قبل تاريخ الانتهاء حيث يجب إزالة المنتج من المخزون. يتم حسابه بناءً على رقم الدفعة/التسلسل.',
                            'alert-date'                    => 'تاريخ التنبيه (بأيام)',
                            'alert-date-hint-tooltip'       => 'عدد الأيام قبل تاريخ الانتهاء حيث يتم تفعيل تنبيه لرقم الدفعة/التسلسل. يتم حسابه بناءً على رقم الدفعة/التسلسل.',
                        ],
                    ],
                ],
            ],

            'additional' => [
                'title' => 'إضافي',
            ],
        ],
    ],

    'infolist' => [
        'sections' => [
            'inventory' => [
                'title' => 'المخزون',

                'entries' => [
                ],

                'fieldsets' => [
                    'tracking' => [
                        'title' => 'التتبع',

                        'entries' => [
                            'track-inventory' => 'تتبع المخزون',
                            'track-by'        => 'التتبع بواسطة',
                            'expiration-date' => 'تاريخ انتهاء الصلاحية',
                        ],
                    ],

                    'operation' => [
                        'title' => 'العمليات',

                        'entries' => [
                            'routes' => 'الطرق',
                        ],
                    ],

                    'logistics' => [
                        'title' => 'اللوجستيات',

                        'entries' => [
                            'responsible' => 'المسؤول',
                            'weight'      => 'الوزن',
                            'volume'      => 'الحجم',
                            'sale-delay'  => 'مدة انتظار العميل (أيام)',
                        ],
                    ],

                    'traceability' => [
                        'title' => 'القابلية للتتبع',

                        'entries' => [
                            'expiration-date'  => 'تاريخ انتهاء الصلاحية (بأيام)',
                            'best-before-date' => 'أفضل استخدام قبل (بأيام)',
                            'removal-date'     => 'تاريخ الإزالة (بأيام)',
                            'alert-date'       => 'تاريخ التنبيه (بأيام)',
                        ],
                    ],
                ],
            ],
        ],
    ],
];
