<?php

return [
    'notification' => [
        'title' => 'تم تحديث عملية التسليم',
        'body'  => 'تم تحديث عملية التسليم بنجاح.',
    ],

    'header-actions' => [
        'print' => [
            'label' => 'طباعة',
        ],

        'delete' => [
            'notification' => [
                'success' => [
                    'title' => 'تم حذف عملية التسليم',
                    'body'  => 'تم حذف عملية التسليم بنجاح.',
                ],

                'error' => [
                    'title' => 'تعذر حذف عملية التسليم',
                    'body'  => 'لا يمكن حذف عملية التسليم لأنها قيد الاستخدام حالياً.',
                ],
            ],
        ],
    ],
];
