<?php

return [
    'label' => 'تحقق',
    'modal-heading' => 'إنشاء طلب مؤجل؟',
    'modal-description' => 'إنشاء طلب مؤجل إذا كانت المنتجات المتبقية ستُعالج لاحقًا. إذا لم يكن الأمر كذلك، فلا تُنشئ طلبًا مؤجلًا.',

    'extra-modal-footer-actions' => [
        'no-backorder' => [
            'label' => 'لا يوجد طلب مؤجل',
        ],
    ],

    'notification' => [
        'warning' => [
            'lines-missing' => [
                'title' => 'لا توجد كميات محجوزة',
                'body' => 'لا توجد كميات محجوزة للتحويل.',
            ],

            'lot-missing' => [
                'title' => 'رقم الدفعة/التسلسل',
                'body' => 'تحتاج إلى توفير رقم دفعة/تسلسل للمنتجات',
            ],

            'serial-qty' => [
                'title' => 'تم تعيين الرقم التسلسلي مسبقًا',
                'body' => 'الرقم التسلسلي موجود تم تخصيصه بالفعل لمنتج آخر.',
            ],

            'partial-package' => [
                'title' => 'لا يمكن نقل محتوى الحزمة نفسه',
                'body' => 'لا يمكنك نقل محتوى الحزمة نفسه أكثر من مرة واحدة خلال عملية نقل واحدة أو تقسيم الحزمة بين موقعين.',
            ],
        ],
    ],
];
